
public class Starsplus {
	public static void main(String[] args) {
		//需求要求打印空心菱形定义变量i控制行先用7层来分析并完成*的输出 
		//空心菱形需要分上下两个部分来打印 并且上下部分都要先打印空格再打印*
		//
		//
		//
/*            菱形                  每行*用数学公式来表示     空格数量                 数学表示
               *      第1行有1个*     2*i-1                有3个空格=（总层数/2+1-1）总层数/2+1-i  
 *            ***     第2行有3个*     2*i-1                有2个空格=（总层数/2+1-2）总层数/2+1-i
 *           *****    第3行有5个*     2*i-1                有1个空格=（总层数/2+1-3）总层数/2+1-i
 *          *******   第4行有3个*     2*i-1                有0个空格=（总层数/2+1-4）总层数/2+1-i
 *           *****    第5行有5个*  (2*(总层数/2+1)-i)*2-1    有1个空格=（5-总层数/2+1）当前层数-(总层数/2+1)
 *            ***     第6行有3个*  (2*(总层数/2+1)-i)*2-1   有2个空格=（6-总层数/2+1）当前层数-(总层数/2+1)
 *             *      第7行有1个*  (2*(总层数/2+1)-i)*2-1  有3个空格=（7-总层数/2+1）当前层数-(总层数/2+1)                               
 * */
//       int totalNum = 15;//定义总层数变量，菱形打印具有普适性
//		for(int i = 1;i <= totalNum;i++) {//用i变量控制层数
//		if(i <= totalNum / 2 + 1) {//先打印上半部分层数
//			for(int k = 1;k <= totalNum/2 + 1 - i;k++) {//上半部分的空格
//				System.out.print(" ");
//		     }
//			for(int j = 1;j <= 2 * i - 1;j++) {//j控制变量控制每行的*输出
//				if(j == 1 || j == 2*i - 1) {//利用判断条件 具体输出*
//					System.out.print("*");
//				}else {//其他情况输出空格
//					System.out.print(" ");
//				}
//			
//			}
//			
//			System.out.println();//每打印一层换行
//	    }
//		else  {//就是层数 i > totalNum / 2 + 1时的情况 
//			for(int g = 1;g <=i-(totalNum/2 + 1);g++) {//利用g来控制空格输出
//				System.out.print(" ");
//			}
//			for(int h = 1;h <= (2*(totalNum/2 + 1) -i)*2 - 1;h++) {//利用h来控制下半部分*的输出
//				if(h == 1 || h == ((2*(totalNum/2+1) - i)*2 - 1)) {//判断条件输出*
//				System.out.print("*");
//			}
//				else {//下半部分其他情况输出空格
//					System.out.print(" ");
//				}
//				}
//			System.out.println();//每打印一层换行
//		}
//	  }
		
	
	}
}


